/********************************************************************************************
题目描述
写出一个程序，接受一个由字母和数字组成的字符串，和一个字符，然后输出输入字符串中含有该字符的个数。不区分大小写。

输入描述:
第一行输入一个有字母和数字以及空格组成的字符串，第二行输入一个字符。

输出描述:
输出输入字符串中含有该字符的个数。

示例1
输入
复制
ABCDEF
A
输出
复制
1
*********************************************************************************************/
//#include <iostream>
//#include <string.h>
//using namespace std;
//
//int main()
//{
//    char str[100];
//    char word;
//    unsigned int i;
//
//    int count =0;
//    gets(str);
//    word = getchar();
//
//    for(i=0;i<strlen(str);i++)
//    {
//        if(word == str[i]|| word == str[i]+ 32 || word == str[i] - 32)
//            count++;
//    }
//    cout << count << endl;
//    return 0;
//}







